cmsis-svd/cmsis-svd/data/Renesas/R7FA4T1BB.svd
                <register>
                    <name>LVD1CR0</name>
                    <description>Voltage Monitor 1 Circuit Control Register 0</description>
                    <addressOffset>0x41A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x82</resetValue>
                    <resetMask>0xf7</resetMask>
                    <fields>
                        <field>
                            <name>RIE</name>
                            <description>Voltage Monitor 1 Interrupt/Reset Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DFDIS</name>
                            <description>Voltage monitor 1 Digital Filter Disabled Mode Select</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Enable the digital filter</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Disable the digital filter</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPE</name>
                            <description>Voltage Monitor 1 Circuit Comparison Result Output Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable voltage monitor 1 circuit comparison result output</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable voltage monitor 1 circuit comparison result output</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FSAMP</name>
                            <description>Sampling Clock Select</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>1/2 LOCO frequency</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>1/4 LOCO frequency</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>1/8 LOCO frequency</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>1/16 LOCO frequency</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RI</name>
                            <description>Voltage Monitor 1 Circuit Mode Select</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Generate voltage monitor 1 interrupt on Vdet1 crossing</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable voltage monitor 1 reset when the voltage falls to and below Vdet1</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RN</name>
                            <description>Voltage Monitor 1 Reset Negate Select</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Negate after a stabilization time (tLVD1) when VCC &gt; Vdet1 is detected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Negate after a stabilization time (tLVD1) on assertion of the LVD1 reset</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LVD2CR0</name>
                    <description>Voltage Monitor 2 Circuit Control Register 0</description>
                    <addressOffset>0x41B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x82</resetValue>
                    <resetMask>0xf7</resetMask>
                    <fields>
                        <field>
                            <name>RIE</name>
                            <description>Voltage Monitor 2 Interrupt/Reset Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DFDIS</name>
                            <description>Voltage monitor 2 Digital Filter Disabled Mode Select</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Enable the digital filter</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Disable the digital filter</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPE</name>
                            <description>Voltage Monitor 2 Circuit Comparison Result Output Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable voltage monitor 2 circuit comparison result output</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable voltage monitor 2 circuit comparison result output</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FSAMP</name>
                            <description>Sampling Clock Select</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>1/2 LOCO frequency</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>1/4 LOCO frequency</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>1/8 LOCO frequency</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>1/16 LOCO frequency</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RI</name>
                            <description>Voltage Monitor 2 Circuit Mode Select</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Generate voltage monitor 2 interrupt on Vdet2 crossing</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable voltage monitor 2 reset when the voltage falls to and below Vdet2</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RN</name>
                            <description>Voltage Monitor 2 Reset Negate Select</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Negate after a stabilization time (tLVD2) when VCC &gt; Vdet2 is detected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Negate after a stabilization time (tLVD2) on assertion of the LVD2 reset</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SOSCCR</name>
                    <description>Sub-Clock Oscillator Control Register</description>
                    <addressOffset>0x480</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>SOSTP</name>
                            <description>Sub Clock Oscillator Stop</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Operate the sub-clock oscillator</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Stop the sub-clock oscillator</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SOMCR</name>
                    <description>Sub-Clock Oscillator Mode Control Register</description>
                    <addressOffset>0x481</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>SODRV</name>
                            <description>Sub-Clock Oscillator Drive Capability Switching</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Standard</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Low</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LOCOCR</name>
                    <description>Low-Speed On-Chip Oscillator Control Register</description>
                    <addressOffset>0x490</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>LCSTP</name>
                            <description>LOCO Stop</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Operate the LOCO clock</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Stop the LOCO clock</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LOCOUTCR</name>
                    <description>LOCO User Trimming Control Register</description>
                    <addressOffset>0x492</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>LOCOUTRM</name>
                            <description>LOCO User Trimming</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
