cmsis-svd/cmsis-svd/data/Renesas/R7FA4T1BB.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>RTC</name>
            <description>Realtime Clock</description>
            <baseAddress>0x40083000</baseAddress>
            <addressBlock>
                <offset>0x22</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x24</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x28</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x40</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>RCR1</name>
                    <description>Reset Control Register 1</description>
                    <addressOffset>0x22</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x0a</resetMask>
                </register>
                <register>
                    <name>RCR2</name>
                    <description>Reset Control Register 2</description>
                    <addressOffset>0x24</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x0e</resetMask>
                    <fields>
                        <field>
                            <name>RESET</name>
                            <description>Software Reset</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>In writing: Invalid (writing 0 has no effect) In reading: Software reset has completed. </description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>In writing: The target registers for software reset are initialized. In reading: Software reset in progress. </description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCR4</name>
                    <description>Reset Control Register 4</description>
                    <addressOffset>0x28</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xfe</resetMask>
                    <fields>
                        <field>
                            <name>RCKSEL</name>
                            <description>Count Source Select</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Sub-clock oscillator is selected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>LOCO is selected</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x02</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>RTCCR%s</name>
                    <description>Time Capture Control Register %s</description>
                    <addressOffset>0x40</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x48</resetMask>
                    <fields>
                        <field>
                            <name>TCEN</name>
                            <description>P402/AGTIO and P403/AGTIO input enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>AGTIO input disable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>AGTIO input enable</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>IWDT</name>
            <description>Independent Watchdog Timer</description>
            <baseAddress>0x40083200</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x04</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>IWDTRR</name>
                    <description>IWDT Refresh Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xff</resetValue>
                    <resetMask>0xff</resetMask>
                </register>
                <register>
                    <name>IWDTSR</name>
                    <description>IWDT Status Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>CNTVAL</name>
                            <description>Down-counter Value</description>
                            <lsb>0</lsb>
                            <msb>13</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>UNDFF</name>
                            <description>Underflow Flag</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No underflow occurred</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Underflow occurred</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>REFEF</name>
                            <description>Refresh Error Flag</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No refresh error occurred</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Refresh error occurred</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
