cmsis-svd/cmsis-svd/data/Renesas/R7FA4T1BB.svd
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x04c</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>CFDTMDF%s_6</name>
                    <description>TX Message Buffer Data Field Register </description>
                    <addressOffset>0x0628</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte ((p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x04c</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>CFDTMDF%s_7</name>
                    <description>TX Message Buffer Data Field Register </description>
                    <addressOffset>0x062C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte ((p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x04c</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>CFDTMDF%s_8</name>
                    <description>TX Message Buffer Data Field Register </description>
                    <addressOffset>0x0630</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte ((p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x04c</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>CFDTMDF%s_9</name>
                    <description>TX Message Buffer Data Field Register </description>
                    <addressOffset>0x0634</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte ((p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x04c</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>CFDTMDF%s_10</name>
                    <description>TX Message Buffer Data Field Register </description>
                    <addressOffset>0x0638</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte ((p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x04c</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>CFDTMDF%s_11</name>
                    <description>TX Message Buffer Data Field Register </description>
                    <addressOffset>0x063C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte ((p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x04c</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>CFDTMDF%s_12</name>
                    <description>TX Message Buffer Data Field Register </description>
                    <addressOffset>0x0640</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte ((p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x04c</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>CFDTMDF%s_13</name>
                    <description>TX Message Buffer Data Field Register </description>
                    <addressOffset>0x0644</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte ((p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x04c</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>CFDTMDF%s_14</name>
                    <description>TX Message Buffer Data Field Register </description>
                    <addressOffset>0x0648</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte ((p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x04c</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>CFDTMDF%s_15</name>
                    <description>TX Message Buffer Data Field Register </description>
                    <addressOffset>0x064C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte ((p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFDTHLACC0</name>
                    <description>TX History List Access Register 0</description>
                    <addressOffset>0x0740</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>BT</name>
                            <description>Buffer Type</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>Flat TX message buffer</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>TX FIFO message buffer number</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>TX Queue message buffer number</description>
                                    <value>#100</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BN</name>
                            <description>Buffer Number</description>
                            <lsb>3</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TMTS</name>
                            <description>Transmit Timestamp</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFDTHLACC1</name>
                    <description>TX History List Access Register 1</description>
                    <addressOffset>0x0744</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TID</name>
                            <description>Transmit ID</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TIFL</name>
                            <description>Transmit Information Label</description>
                            <lsb>16</lsb>
                            <msb>17</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
