cmsis-svd/cmsis-svd/data/Renesas/R7FA4T1BB.svd
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDRMDF%s_7</name>
                    <description>RX Message Buffer Data Field 7 Registers</description>
                    <addressOffset>0x0948</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDRMDF%s_8</name>
                    <description>RX Message Buffer Data Field 8 Registers</description>
                    <addressOffset>0x094C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDRMDF%s_9</name>
                    <description>RX Message Buffer Data Field 9 Registers</description>
                    <addressOffset>0x0950</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDRMDF%s_10</name>
                    <description>RX Message Buffer Data Field 10 Registers</description>
                    <addressOffset>0x0954</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDRMDF%s_11</name>
                    <description>RX Message Buffer Data Field 11 Registers</description>
                    <addressOffset>0x0958</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDRMDF%s_12</name>
                    <description>RX Message Buffer Data Field 12 Registers</description>
                    <addressOffset>0x095C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDRMDF%s_13</name>
                    <description>RX Message Buffer Data Field 13 Registers</description>
                    <addressOffset>0x0960</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDRMDF%s_14</name>
                    <description>RX Message Buffer Data Field 14 Registers</description>
                    <addressOffset>0x0964</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDRMDF%s_15</name>
                    <description>RX Message Buffer Data Field 15 Registers</description>
                    <addressOffset>0x0968</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>8-15</dimIndex>
                    <name>CFDRMID%s</name>
                    <description>RX Message Buffer ID Registers</description>
                    <addressOffset>0x0D20</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMID</name>
                            <description>RX Message Buffer ID Field</description>
                            <lsb>0</lsb>
                            <msb>28</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMRTR</name>
                            <description>RX Message Buffer RTR Bit</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMIDE</name>
                            <description>RX Message Buffer IDE Bit</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>STD-ID is stored</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>EXT-ID is stored</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>8-15</dimIndex>
                    <name>CFDRMPTR%s</name>
                    <description>RX Message Buffer Pointer Registers</description>
                    <addressOffset>0x0D24</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMTS</name>
                            <description>RX Message Buffer Timestamp Field</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDLC</name>
                            <description>RX Message Buffer DLC Field</description>
                            <lsb>28</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
