cmsis-svd/cmsis-svd/data/Renesas/R7FA4T1BB.svd
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>16-23</dimIndex>
                    <name>CFDRMDF%s_0</name>
                    <description>RX Message Buffer Data Field 0 Registers</description>
                    <addressOffset>0x112C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>16-23</dimIndex>
                    <name>CFDRMDF%s_1</name>
                    <description>RX Message Buffer Data Field 1 Registers</description>
                    <addressOffset>0x1130</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>16-23</dimIndex>
                    <name>CFDRMDF%s_2</name>
                    <description>RX Message Buffer Data Field 2 Registers</description>
                    <addressOffset>0x1134</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>16-23</dimIndex>
                    <name>CFDRMDF%s_3</name>
                    <description>RX Message Buffer Data Field 3 Registers</description>
                    <addressOffset>0x1138</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>16-23</dimIndex>
                    <name>CFDRMDF%s_4</name>
                    <description>RX Message Buffer Data Field 4 Registers</description>
                    <addressOffset>0x113C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>16-23</dimIndex>
                    <name>CFDRMDF%s_5</name>
                    <description>RX Message Buffer Data Field 5 Registers</description>
                    <addressOffset>0x1140</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>16-23</dimIndex>
                    <name>CFDRMDF%s_6</name>
                    <description>RX Message Buffer Data Field 6 Registers</description>
                    <addressOffset>0x1144</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>16-23</dimIndex>
                    <name>CFDRMDF%s_7</name>
                    <description>RX Message Buffer Data Field 7 Registers</description>
                    <addressOffset>0x1148</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>16-23</dimIndex>
                    <name>CFDRMDF%s_8</name>
                    <description>RX Message Buffer Data Field 8 Registers</description>
                    <addressOffset>0x114C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>16-23</dimIndex>
                    <name>CFDRMDF%s_9</name>
                    <description>RX Message Buffer Data Field 9 Registers</description>
                    <addressOffset>0x1150</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x004C</dimIncrement>
                    <dimIndex>16-23</dimIndex>
                    <name>CFDRMDF%s_10</name>
                    <description>RX Message Buffer Data Field 10 Registers</description>
                    <addressOffset>0x1154</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte (p × 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte ((p × 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
